PayPalAPISoapBinding.GetIncentiveEvaluation.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:ns2="urn:ebay:apis:CoreComponentTypes"
    xmlns:ns4="urn:ebay:apis:EnhancedDataTypes"
    xmlns:ns3="urn:ebay:apis:eBLBaseComponents"
    xmlns:ns1="urn:ebay:api:PayPalAPI">
 <SOAP-ENV:Header>
  <ns1:RequesterCredentials>
   <ns3:eBayAuthToken></ns3:eBayAuthToken>
   <ns3:HardExpirationWarning></ns3:HardExpirationWarning>
   <ns3:Credentials>
    <ns3:AppId></ns3:AppId>
    <ns3:DevId></ns3:DevId>
    <ns3:AuthCert></ns3:AuthCert>
    <ns3:Username></ns3:Username>
    <ns3:Password></ns3:Password>
    <ns3:Signature></ns3:Signature>
    <ns3:Subject></ns3:Subject>
    <ns3:AuthToken></ns3:AuthToken>
   </ns3:Credentials>
  </ns1:RequesterCredentials>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
   <ns1:GetIncentiveEvaluationReq>
    <ns1:GetIncentiveEvaluationRequest>
     <ns3:GetIncentiveEvaluationRequestDetails>
      <ns3:ExternalBuyerId></ns3:ExternalBuyerId>
      <ns3:IncentiveCodes></ns3:IncentiveCodes>
      <ns3:IncentiveCodes></ns3:IncentiveCodes>
      <ns3:ApplyIndication>
       <ns3:PaymentRequestID></ns3:PaymentRequestID>
       <ns3:ItemId></ns3:ItemId>
      </ns3:ApplyIndication>
      <ns3:ApplyIndication>
       <ns3:PaymentRequestID></ns3:PaymentRequestID>
       <ns3:ItemId></ns3:ItemId>
      </ns3:ApplyIndication>
      <ns3:Buckets>
       <ns3:Items>
       </ns3:Items>
       <ns3:Items>
       </ns3:Items>
       <ns3:BucketId></ns3:BucketId>
       <ns3:SellerId></ns3:SellerId>
       <ns3:ExternalSellerId></ns3:ExternalSellerId>
       <ns3:BucketSubtotalAmt currencyID="AFA"></ns3:BucketSubtotalAmt>
       <ns3:BucketShippingAmt currencyID="AFA"></ns3:BucketShippingAmt>
       <ns3:BucketInsuranceAmt currencyID="AFA"></ns3:BucketInsuranceAmt>
       <ns3:BucketSalesTaxAmt currencyID="AFA"></ns3:BucketSalesTaxAmt>
       <ns3:BucketTotalAmt currencyID="AFA"></ns3:BucketTotalAmt>
      </ns3:Buckets>
      <ns3:Buckets>
       <ns3:Items>
       </ns3:Items>
       <ns3:Items>
       </ns3:Items>
       <ns3:BucketId></ns3:BucketId>
       <ns3:SellerId></ns3:SellerId>
       <ns3:ExternalSellerId></ns3:ExternalSellerId>
       <ns3:BucketSubtotalAmt currencyID="AFA"></ns3:BucketSubtotalAmt>
       <ns3:BucketShippingAmt currencyID="AFA"></ns3:BucketShippingAmt>
       <ns3:BucketInsuranceAmt currencyID="AFA"></ns3:BucketInsuranceAmt>
       <ns3:BucketSalesTaxAmt currencyID="AFA"></ns3:BucketSalesTaxAmt>
       <ns3:BucketTotalAmt currencyID="AFA"></ns3:BucketTotalAmt>
      </ns3:Buckets>
      <ns3:CartTotalAmt currencyID="AFA"></ns3:CartTotalAmt>
      <ns3:RequestDetails>
       <ns3:RequestId></ns3:RequestId>
       <ns3:RequestType>InCheckout</ns3:RequestType>
       <ns3:RequestDetailLevel>Aggregated</ns3:RequestDetailLevel>
      </ns3:RequestDetails>
     </ns3:GetIncentiveEvaluationRequestDetails>
     <ns1:DetailLevel>ReturnAll</ns1:DetailLevel>
     <ns1:DetailLevel>ReturnAll</ns1:DetailLevel>
     <ns1:ErrorLanguage></ns1:ErrorLanguage>
     <ns1:Version></ns1:Version>
     <!-- extensibility element(s) -->
    </ns1:GetIncentiveEvaluationRequest>
   </ns1:GetIncentiveEvaluationReq>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
